#### SetAttribute Method (String, IList(IFCAnyHandle))

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetAttribute( 	string name, 	IList<IFCAnyHandle> values ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAttribute ( _ 	name As String, _ 	values As IList(Of IFCAnyHandle) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAttribute( 	String^ name,  	IList<IFCAnyHandle^>^ values ) ``` |

#### Parameters

name
:   Type:  System String

values
:   Type:  System.Collections.Generic IList   IFCAnyHandle

# See Also

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace